Tekla Open API Reference for Tekla Structures 2025
IResizeable Methods
The IResizeable type exposes the following members.
Methods
Name | Description
Resize
 Resizes the object to the specified size, overriding possible scaling settings.
Top
See Also
Reference
IResizeable Interface
Tekla.Structures.Drawing Namespace